In [1]:
import pandas as pd
import numpy as np

In [2]:
data1 = pd.Series(['jack', 'kate', np.nan, 'james', None])

In [3]:
data1

0     jack
1     kate
2      NaN
3    james
4     None
dtype: object

In [5]:
data1.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data2 = pd.Series([1, NA, 2.5, NA, 5.0, NA, 7.5])

In [8]:
data2

0    1.0
1    NaN
2    2.5
3    NaN
4    5.0
5    NaN
6    7.5
dtype: float64

In [10]:
data3 = data2.dropna()

In [11]:
data3

0    1.0
2    2.5
4    5.0
6    7.5
dtype: float64

In [12]:
data4 = data2[data2.notnull()]

In [13]:
data4

0    1.0
2    2.5
4    5.0
6    7.5
dtype: float64

In [14]:
frame1 = pd.DataFrame([[1.,5.0,7.5],[1.,NA,NA],[NA,NA,NA],[NA,10.,15.0]])

In [15]:
frame1

     0     1     2
0  1.0   5.0   7.5
1  1.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  10.0  15.0

In [16]:
frame1_cleaned = frame1.dropna()

In [17]:
frame1_cleaned

     0    1    2
0  1.0  5.0  7.5

In [21]:
frame1.dropna(how='all')

     0     1     2   3
0  1.0   5.0   7.5 NaN
1  1.0   NaN   NaN NaN
3  NaN  10.0  15.0 NaN

In [19]:
frame1[3]= NA

In [20]:
frame1

     0     1     2   3
0  1.0   5.0   7.5 NaN
1  1.0   NaN   NaN NaN
2  NaN   NaN   NaN NaN
3  NaN  10.0  15.0 NaN

In [22]:
frame1.dropna(axis=1, how="all")

     0     1     2
0  1.0   5.0   7.5
1  1.0   NaN   NaN
2  NaN   NaN   NaN
3  NaN  10.0  15.0

In [23]:
frame2 = pd.DataFrame(np.random.randn(7,3))

In [24]:
frame2

          0         1         2
0 -0.533932  0.605068 -2.888385
1 -2.015759  0.129096 -0.634123
2  0.510306  0.676781  0.069653
3  0.094973  0.126054  0.719277
4 -0.121647 -1.155785 -0.360312
5  0.645677  0.235927  0.445143
6  0.754660 -0.459594  1.056094

In [25]:
frame2.iloc[:4 , 1] = NA

In [26]:
frame2.iloc[:2 , 2] = NA

In [27]:
frame2

          0         1         2
0 -0.533932       NaN       NaN
1 -2.015759       NaN       NaN
2  0.510306       NaN  0.069653
3  0.094973       NaN  0.719277
4 -0.121647 -1.155785 -0.360312
5  0.645677  0.235927  0.445143
6  0.754660 -0.459594  1.056094

In [28]:
frame2.dropna()

          0         1         2
4 -0.121647 -1.155785 -0.360312
5  0.645677  0.235927  0.445143
6  0.754660 -0.459594  1.056094

In [29]:
frame2.dropna(thresh=2)

          0         1         2
2  0.510306       NaN  0.069653
3  0.094973       NaN  0.719277
4 -0.121647 -1.155785 -0.360312
5  0.645677  0.235927  0.445143
6  0.754660 -0.459594  1.056094

In [37]:
frame2

          0          1         2
0 -0.533932  42.000000 -1.000000
1 -2.015759  42.000000 -1.000000
2  0.510306  42.000000  0.069653
3  0.094973  42.000000  0.719277
4 -0.121647  -1.155785 -0.360312
5  0.645677   0.235927  0.445143
6  0.754660  -0.459594  1.056094

In [31]:
frame2.fillna(0)

          0         1         2
0 -0.533932  0.000000  0.000000
1 -2.015759  0.000000  0.000000
2  0.510306  0.000000  0.069653
3  0.094973  0.000000  0.719277
4 -0.121647 -1.155785 -0.360312
5  0.645677  0.235927  0.445143
6  0.754660 -0.459594  1.056094

In [35]:
frame2.fillna({1: 42, 2: -1},inplace=True )

In [36]:
frame2

          0          1         2
0 -0.533932  42.000000 -1.000000
1 -2.015759  42.000000 -1.000000
2  0.510306  42.000000  0.069653
3  0.094973  42.000000  0.719277
4 -0.121647  -1.155785 -0.360312
5  0.645677   0.235927  0.445143
6  0.754660  -0.459594  1.056094

In [38]:
frame3 = pd.DataFrame(np.random.randn(6,3))

In [39]:
frame3

          0         1         2
0 -0.785617  2.274198  1.128264
1 -1.066051 -0.212692  0.265269
2  0.238935 -2.237579  2.244434
3  0.377828 -0.403297  1.264909
4  0.399840  0.014481  0.647398
5 -1.833108 -0.495447  1.225906

In [40]:
frame3.iloc[2:,1] = NA

In [41]:
frame3.iloc[4:,2] = NA

In [44]:
frame3

          0         1         2
0 -0.785617  2.274198  1.128264
1 -1.066051 -0.212692  0.265269
2  0.238935       NaN  2.244434
3  0.377828       NaN  1.264909
4  0.399840       NaN       NaN
5 -1.833108       NaN       NaN

In [43]:
frame3.fillna(method='ffill')

          0         1         2
0 -0.785617  2.274198  1.128264
1 -1.066051 -0.212692  0.265269
2  0.238935 -0.212692  2.244434
3  0.377828 -0.212692  1.264909
4  0.399840 -0.212692  1.264909
5 -1.833108 -0.212692  1.264909

In [45]:
frame3.fillna(method='ffill', limit=2)

          0         1         2
0 -0.785617  2.274198  1.128264
1 -1.066051 -0.212692  0.265269
2  0.238935 -0.212692  2.244434
3  0.377828 -0.212692  1.264909
4  0.399840       NaN  1.264909
5 -1.833108       NaN  1.264909

In [46]:
frame3.fillna(frame3.mean())

          0         1         2
0 -0.785617  2.274198  1.128264
1 -1.066051 -0.212692  0.265269
2  0.238935  1.030753  2.244434
3  0.377828  1.030753  1.264909
4  0.399840  1.030753  1.225719
5 -1.833108  1.030753  1.225719

In [47]:
frame3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      float64
 1   1       2 non-null      float64
 2   2       4 non-null      float64
dtypes: float64(3)
memory usage: 272.0 bytes

In [48]:
frame3.describe()

              0         1         2
count  6.000000  2.000000  4.000000
mean  -0.444695  1.030753  1.225719
std    0.925973  1.758496  0.810612
min   -1.833108 -0.212692  0.265269
25%   -0.995942  0.409031  0.912516
50%   -0.273341  1.030753  1.196587
75%    0.343105  1.652476  1.509790
max    0.399840  2.274198  2.244434

In [49]:
frame4 = pd.DataFrame({
    'key1': ["one", "two"] * 3 + ['two'],
    'key2': [1,1,2,3,3,4,4]  
})

In [50]:
frame4

  key1  key2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4
6  two     4

In [51]:
frame4.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [52]:
frame4.drop_duplicates()

  key1  key2
0  one     1
1  two     1
2  one     2
3  two     3
4  one     3
5  two     4

In [53]:
frame4['value1'] = range(7)

In [54]:
frame4

  key1  key2  value1
0  one     1       0
1  two     1       1
2  one     2       2
3  two     3       3
4  one     3       4
5  two     4       5
6  two     4       6

In [55]:
frame4.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [56]:
frame4.drop_duplicates(['key1'])

  key1  key2  value1
0  one     1       0
1  two     1       1

In [59]:
frame4.drop_duplicates(['key1','key2'],keep='last')

  key1  key2  value1
0  one     1       0
1  two     1       1
2  one     2       2
3  two     3       3
4  one     3       4
6  two     4       6

In [60]:
world = pd.DataFrame({
    "code": ["tur", "fra", "usa", "ita", "ger"],
    "name": ["turkey", "france", "united states", "italy", "germany"],
    "population": [100, 200, 300, 400, 500]
})

In [61]:
world

  code           name  population
0  tur         turkey         100
1  fra         france         200
2  usa  united states         300
3  ita          italy         400
4  ger        germany         500

In [65]:
code_to_continent = {
    'tur': 'asia',
    'fra': 'europe',
    'usa': 'north america',
    'ita': 'europe',
    'ger': 'europe'
}

In [64]:
world['code']

0    tur
1    fra
2    usa
3    ita
4    ger
Name: code, dtype: object

In [66]:
world['continent'] = world['code'].map(code_to_continent)

In [67]:
world

  code           name  population      continent
0  tur         turkey         100           asia
1  fra         france         200         europe
2  usa  united states         300  north america
3  ita          italy         400         europe
4  ger        germany         500         europe

In [68]:
world['code'].map(lambda code : code_to_continent[code])

0             asia
1           europe
2    north america
3           europe
4           europe
Name: code, dtype: object

In [69]:
data9 = pd.Series([1., 4., 8., -100., 15., 23. , -200., 42., -300])

In [72]:
data9

0      1.0
1      4.0
2      8.0
3   -100.0
4     15.0
5     23.0
6   -200.0
7     42.0
8   -300.0
dtype: float64

In [71]:
data9.replace([-100,-200,-300], NA)

0     1.0
1     4.0
2     8.0
3     NaN
4    15.0
5    23.0
6     NaN
7    42.0
8     NaN
dtype: float64

In [74]:
data9.replace([-100,-200,-300], [0,-10,NA])

0     1.0
1     4.0
2     8.0
3     0.0
4    15.0
5    23.0
6   -10.0
7    42.0
8     NaN
dtype: float64

In [75]:
data9.replace({-100:0 ,-200: -10 ,-300: NA})

0     1.0
1     4.0
2     8.0
3     0.0
4    15.0
5    23.0
6   -10.0
7    42.0
8     NaN
dtype: float64

In [84]:
ages = [19 , 20, 22 ,25, 27, 21, 36, 39, 41, 28, 37, 48, 51, 55, 58 , 64]

In [85]:
bins = [18, 25, 35, 60, 100]

In [86]:
employees = pd.cut(ages, bins)

In [87]:
employees

[(18, 25], (18, 25], (18, 25], (18, 25], (25, 35], ..., (35, 60], (35, 60], (35, 60], (35, 60], (60, 100]]
Length: 16
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [88]:
employees.codes

array([0, 0, 0, 0, 1, 0, 2, 2, 2, 1, 2, 2, 2, 2, 2, 3], dtype=int8)

In [89]:
employees.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [90]:
pd.value_counts(employees)

(35, 60]     8
(18, 25]     5
(25, 35]     2
(60, 100]    1
dtype: int64

In [91]:
group_names = ["Junior",'Young','Middle','Senior']

In [93]:
employees = pd.cut(ages, bins, labels= group_names)

In [94]:
employees

['Junior', 'Junior', 'Junior', 'Junior', 'Young', ..., 'Middle', 'Middle', 'Middle', 'Middle', 'Senior']
Length: 16
Categories (4, object): ['Junior' < 'Young' < 'Middle' < 'Senior']